Autodesk.Revit.DB.LinearArray.ArrayElementsWithoutAssociation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},System.Int32,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new linear array from a set of elements.
Remarks:
The resulting elements will not be associated with an array element.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if elements include view-specific elements.
If elements include view-specific elements, they must belong to this view.
ids:
The elements to array.
count:
The number of array members to create including the initial
element grouping. Must between 2 and 200.
translationToAnchorMember:
The translation vector for the array.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The ids of the elements created during the operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in ids do not exist in the document.
-or-
One or more elements in ids is owned by different views and thus cannot be arrayed together.
-or-
One or more elements in ids is not arrayable.
-or-
count must be between 2 and 200.
-or-
The view is invalid for specific view elements array.
-or-
The translation point vector is invalid to array the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the linear array.

Autodesk.Revit.DB.LinearArray.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection`1{Autodesk.Revit.DB.ElementId},System.Int32,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new linear array element from a set of elements.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if elements include view-specific elements.
If elements include view-specific elements, they must belong to this view.
ids:
The elements to array.
count:
The number of array members to create including the initial
element grouping. Must between 2 and 200.
translationToAnchorMember:
The translation vector for the array.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The new linear array element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in ids do not exist in the document.
-or-
One or more elements in ids is owned by different views and thus cannot be arrayed together.
-or-
One or more elements in ids is not arrayable.
-or-
count must be between 2 and 200.
-or-
The view is invalid for specific view elements array.
-or-
The translation point vector is invalid to array the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the linear array.